# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [1]:
import mysql.connector

### Connect to DB using Mysql-connector-python package

In [3]:
conn = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="mysql@12357",
)
cursor = conn.cursor()

### You are required to create a database named 'e_commerce'

In [4]:
cursor.execute("CREATE DATABASE e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [9]:
config = {
    'user': 'root',
    'password': 'mysql@12357',  # Replace with your actual password
    'host': '127.0.0.1',
    'database': 'e_commerce',  # Specify the database here
    'raise_on_warnings': True
}
conn = mysql.connector.connect(**config)

cursor = conn.cursor()

tables = [
    """CREATE TABLE supplier (
        SUPP_ID INT PRIMARY KEY,
        SUPP_NAME VARCHAR(50),
        SUPP_CITY VARCHAR(50),
        SUPP_PHONE VARCHAR(10)
    )""",
    
    """CREATE TABLE customer (
        CUS_ID INT NOT NULL,
        CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
        CUS_PHONE VARCHAR(10),
        CUS_CITY VARCHAR(30),
        CUS_GENDER CHAR,
        PRIMARY KEY (CUS_ID)
    )""",
    
    """CREATE TABLE category (
        CAT_ID INT NOT NULL,
        CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
        PRIMARY KEY (CAT_ID)
    )""",
    
    """CREATE TABLE product (
        PRO_ID INT NOT NULL,
        PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
        PRO_DESC VARCHAR(60) NULL DEFAULT NULL,
        CAT_ID INT NOT NULL,
        PRIMARY KEY (PRO_ID),
        FOREIGN KEY (CAT_ID) REFERENCES category (CAT_ID)
    )""",
    
    """CREATE TABLE product_details (
        PROD_ID INT NOT NULL,
        PRO_ID INT NOT NULL,
        SUPP_ID INT NOT NULL,
        PROD_PRICE INT NOT NULL,
        PRIMARY KEY (PROD_ID),
        FOREIGN KEY (PRO_ID) REFERENCES product (PRO_ID),
        FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID)
    )""",
    
    """CREATE TABLE `order` (
        ORD_ID INT NOT NULL,
        ORD_AMOUNT INT NOT NULL,
        ORD_DATE DATE,
        CUS_ID INT NOT NULL,
        PROD_ID INT NOT NULL,
        PRIMARY KEY (ORD_ID),
        FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID),
        FOREIGN KEY (PROD_ID) REFERENCES product_details(PROD_ID)
    )""",
    
    """CREATE TABLE rating (
        RAT_ID INT NOT NULL,
        CUS_ID INT NOT NULL,
        SUPP_ID INT NOT NULL,
        RAT_RATSTARS INT NOT NULL,
        PRIMARY KEY (RAT_ID),
        FOREIGN KEY (SUPP_ID) REFERENCES supplier (SUPP_ID),
        FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID)
    )"""
]

for table in tables:
    cursor.execute(table)
    print(f"Table created successfully")

conn.commit()

cursor = conn.cursor()

Table created successfully
Table created successfully
Table created successfully
Table created successfully
Table created successfully
Table created successfully
Table created successfully

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- |
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 |
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [10]:
# insert into "supplier" table
cursor.execute("""
INSERT INTO supplier VALUES
(1, 'Rajesh Retails', 'Delhi', '1234567890'),
(2, 'Appario Ltd.', 'Mumbai', '2589631470'),
(3, 'Knome products', 'Bangalore', '9785462315'),
(4, 'Bansal Retails', 'Kochi', '8975463285'),
(5, 'Mittal Ltd.', 'Lucknow', '7898456532')
""")
conn.commit()
print("Data inserted into supplier table")

Data inserted into supplier table

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [11]:
# insert into "customer" table
cursor.execute("""
INSERT INTO customer VALUES
(1, 'AAKASH', '9999999999', 'DELHI', 'M'),
(2, 'AMAN', '9785463215', 'NOIDA', 'M'),
(3, 'NEHA', '9999999998', 'MUMBAI', 'F'),
(4, 'MEGHA', '9994562399', 'KOLKATA', 'F'),
(5, 'PULKIT', '7895999999', 'LUCKNOW', 'M')
""")
conn.commit()
print("Data inserted into customer table")

Data inserted into customer table

#### Table:  category
| CAT_ID | CAT_NAME |
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES |
| 4 | ELECTRONICS |
| 5 | CLOTHES |

In [12]:
# insert into "categoty" table
cursor.execute("""
INSERT INTO category VALUES
(1, 'BOOKS'),
(2, 'GAMES'),
(3, 'GROCERIES'),
(4, 'ELECTRONICS'),
(5, 'CLOTHES')
""")
conn.commit()
print("Data inserted into category table")

Data inserted into category table

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- |
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 |
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [13]:
# insert into "product" table
cursor.execute("""
INSERT INTO product VALUES
(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
(2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
(3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),
(4, 'OATS', 'REURENTBTOTH', 3),
(5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)
""")
conn.commit()
print("Data inserted into product table")

Data inserted into product table

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- |
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 |
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [14]:
# insert into "product_details" table
cursor.execute("""
INSERT INTO product_details VALUES
(1, 1, 2, 1500),
(2, 3, 5, 30000),
(3, 5, 1, 3000),
(4, 2, 3, 2500),
(5, 4, 1, 1000)
""")
conn.commit()
print("Data inserted into product_details table")

Data inserted into product_details table

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [15]:
# insert into "orders" table
cursor.execute("""
INSERT INTO `order` VALUES
(20, 1500, '2021-10-12', 3, 5),
(25, 30500, '2021-09-16', 5, 2),
(26, 2000, '2021-10-05', 1, 1),
(30, 3500, '2021-08-16', 4, 3),
(50, 2000, '2021-10-06', 2, 1)
""")
conn.commit()
print("Data inserted into order table")

Data inserted into order table

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- |
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 |
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [16]:
# insert into "rating" table
cursor.execute("""
INSERT INTO rating VALUES
(1, 2, 2, 4),
(2, 3, 4, 3),
(3, 5, 1, 5),
(4, 1, 3, 2),
(5, 4, 5, 4)
""")
conn.commit()
print("Data inserted into rating table")

Data inserted into rating table

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [17]:
query = """
SELECT c.CUS_GENDER, COUNT(DISTINCT c.CUS_ID) as CustomerCount
FROM customer c
JOIN `order` o ON c.CUS_ID = o.CUS_ID
WHERE o.ORD_AMOUNT >= 3000
GROUP BY c.CUS_GENDER
"""

cursor.execute(query)

results = cursor.fetchall()

print("Gender | Customer Count")
print("-------|----------------")
for (gender, count) in results:
    print(f"{gender:6} | {count:15}")

Gender | Customer Count
-------|----------------
F      |               1
M      |               1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [18]:
query = """
SELECT o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE, p.PRO_NAME
FROM `order` o
JOIN product_details pd ON o.PROD_ID = pd.PROD_ID
JOIN product p ON pd.PRO_ID = p.PRO_ID
WHERE o.CUS_ID = 2
"""

cursor.execute(query)

results = cursor.fetchall()

print("Order ID | Order Amount | Order Date | Product Name")
print("---------|--------------|------------|-------------")
for (ord_id, ord_amount, ord_date, pro_name) in results:
    print(f"{ord_id:8} | {ord_amount:12} | {ord_date} | {pro_name}")

Order ID | Order Amount | Order Date | Product Name
---------|--------------|------------|-------------
      50 |         2000 | 2021-10-06 | GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [19]:
query = """
SELECT s.SUPP_ID, s.SUPP_NAME, s.SUPP_CITY, s.SUPP_PHONE, COUNT(DISTINCT pd.PRO_ID) as product_count
FROM supplier s
JOIN product_details pd ON s.SUPP_ID = pd.SUPP_ID
GROUP BY s.SUPP_ID
HAVING product_count > 1
"""

cursor.execute(query)

# Fetch all the results
results = cursor.fetchall()

# Display the results
print("Supplier ID | Supplier Name | Supplier City | Supplier Phone | Product Count")
print("------------|---------------|---------------|----------------|---------------")
for (supp_id, supp_name, supp_city, supp_phone, product_count) in results:
    print(f"{supp_id:11} | {supp_name:13} | {supp_city:13} | {supp_phone:14} | {product_count:14}")

Supplier ID | Supplier Name | Supplier City | Supplier Phone | Product Count
------------|---------------|---------------|----------------|---------------
          1 | Rajesh Retails | Delhi         | 1234567890     |              2

### Q6) Find the category of the product whose order amount is minimum.

In [20]:
query = """
SELECT c.CAT_ID, c.CAT_NAME
FROM category c
JOIN product p ON c.CAT_ID = p.CAT_ID
JOIN product_details pd ON p.PRO_ID = pd.PRO_ID
JOIN `order` o ON pd.PROD_ID = o.PROD_ID
WHERE o.ORD_AMOUNT = (
    SELECT MIN(ORD_AMOUNT)
    FROM `order`
)
"""

cursor.execute(query)

result = cursor.fetchone()

if result:
    cat_id, cat_name = result
    print(f"Category of the product with minimum order amount:")
    print(f"Category ID: {cat_id}")
    print(f"Category Name: {cat_name}")
else:
    print("No result found.")

Category of the product with minimum order amount:
Category ID: 3
Category Name: GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [21]:
query = """
SELECT DISTINCT p.PRO_ID, p.PRO_NAME
FROM product p
JOIN product_details pd ON p.PRO_ID = pd.PRO_ID
JOIN `order` o ON pd.PROD_ID = o.PROD_ID
WHERE o.ORD_DATE > '2021-10-05'
ORDER BY p.PRO_ID
"""

cursor.execute(query)

results = cursor.fetchall()

print("Product ID | Product Name")
print("-----------|-------------")
for (pro_id, pro_name) in results:
    print(f"{pro_id:10} | {pro_name}")

Product ID | Product Name
-----------|-------------
         1 | GTA V
         4 | OATS

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [22]:
query = """
SELECT s.SUPP_ID, s.SUPP_NAME, r.RAT_RATSTARS, c.CUS_NAME
FROM supplier s
JOIN rating r ON s.SUPP_ID = r.SUPP_ID
JOIN customer c ON r.CUS_ID = c.CUS_ID
ORDER BY r.RAT_RATSTARS DESC
LIMIT 3
"""

cursor.execute(query)

results = cursor.fetchall()

print("Supplier ID | Supplier Name | Rating | Customer Name")
print("------------|---------------|--------|---------------")
for (supp_id, supp_name, rating, cus_name) in results:
    print(f"{supp_id:11} | {supp_name:13} | {rating:6} | {cus_name}")

Supplier ID | Supplier Name | Rating | Customer Name
------------|---------------|--------|---------------
          1 | Rajesh Retails |      5 | PULKIT
          2 | Appario Ltd.  |      4 | AMAN
          5 | Mittal Ltd.   |      4 | MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [24]:
query = """
SELECT CUS_NAME, CUS_GENDER
FROM customer
WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'
"""

cursor.execute(query)

results = cursor.fetchall()

print("Customer Name | Gender")
print("--------------|-------")
for (cus_name, cus_gender) in results:
    print(f"{cus_name:14} | {cus_gender}")

Customer Name | Gender
--------------|-------
AAKASH         | M
AMAN           | M
NEHA           | F
MEGHA          | F

### Q10) Display the total order amount of the male customers.

In [25]:
query = """
SELECT SUM(o.ORD_AMOUNT) as TotalOrderAmount
FROM `order` o
JOIN customer c ON o.CUS_ID = c.CUS_ID
WHERE c.CUS_GENDER = 'M'
"""

cursor.execute(query)

result = cursor.fetchone()

if result[0] is not None:
    print(f"Total Order Amount for Male Customers: Rs. {result[0]}")
else:
    print("No orders found for male customers.")

Total Order Amount for Male Customers: Rs. 34500

### Q11) Display all the Customers left outer join with  the orders

In [26]:
query = """
SELECT c.CUS_ID, c.CUS_NAME, c.CUS_PHONE, c.CUS_CITY, c.CUS_GENDER,
       o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE
FROM customer c
LEFT JOIN `order` o ON c.CUS_ID = o.CUS_ID
ORDER BY c.CUS_ID, o.ORD_ID
"""

cursor.execute(query)

# Fetch all the results
results = cursor.fetchall()

# Display the results
print("CUS_ID | CUS_NAME | CUS_PHONE  | CUS_CITY | CUS_GENDER | ORD_ID | ORD_AMOUNT | ORD_DATE")
print("-------|----------|------------|----------|------------|--------|------------|----------")
for row in results:
    cus_id, cus_name, cus_phone, cus_city, cus_gender, ord_id, ord_amount, ord_date = row
    ord_id = ord_id if ord_id else "NULL"
    ord_amount = ord_amount if ord_amount else "NULL"
    ord_date = ord_date if ord_date else "NULL"
    print(f"{cus_id:6} | {cus_name:8} | {cus_phone:10} | {cus_city:8} | {cus_gender:10} | {ord_id:6} | {ord_amount:10} | {ord_date}")

# Close the cursor and connection
cursor.close()
conn.close()

CUS_ID | CUS_NAME | CUS_PHONE  | CUS_CITY | CUS_GENDER | ORD_ID | ORD_AMOUNT | ORD_DATE
-------|----------|------------|----------|------------|--------|------------|----------
     1 | AAKASH   | 9999999999 | DELHI    | M          |     26 |       2000 | 2021-10-05
     2 | AMAN     | 9785463215 | NOIDA    | M          |     50 |       2000 | 2021-10-06
     3 | NEHA     | 9999999998 | MUMBAI   | F          |     20 |       1500 | 2021-10-12
     4 | MEGHA    | 9994562399 | KOLKATA  | F          |     30 |       3500 | 2021-08-16
     5 | PULKIT   | 7895999999 | LUCKNOW  | M          |     25 |      30500 | 2021-09-16

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)